src/QuanLyHeThongComApp/test/TestSuaNguoiDungNhom/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quan="QuanLyHeThongComApp">
  <soapenv:Body>
    <quan:SuaNguoiDung_NhomOperation>
      <username>sua</username>
      <password>sua</password>
      <id_nguoiDung>2</id_nguoiDung>
      <tenNhom>giaovien</tenNhom>
    </quan:SuaNguoiDung_NhomOperation>
  </soapenv:Body>
</soapenv:Envelope>