trunk/src/QuanLyHeThongComApp/test/TestXoaNguoiDungNhom/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quan="QuanLyHeThongComApp">
  <soapenv:Body>
    <quan:XoaNguoiDung_NhomOperation>
      <idNguoiDung>3</idNguoiDung>
    </quan:XoaNguoiDung_NhomOperation>
  </soapenv:Body>
</soapenv:Envelope>